{
  "HomePage": {
    "resume": "Currículo",
    "title": "Lucas Sodré Salgado",
    "subtitle": "Full Stack Developer",
    "pais": "Brasil",
    "xp": "Experiência",
    "xp_disc": "Minha jornada profissional e principais conquistas",
    "f1_card_title": "Desenvolvedor Java Spring Boot",
    "f1_card_p1": "• Desenvolvimento de API para consulta interna da empresa.",
    "f1_card_p2": "• Implementei a consulta de serviços pagos com uso de cache, otimizando o fluxo de dados e reduzindo significativamente os custos operacionais.",
    "f1_card_p3": "• Outras atividades rotineiras: criação de testes unitários e escrever documentação",
    "card2": {
      "title": "Desenvolvedor Spring Boot",
      "time": "20/06/2022 - Atual",
      "p1": "• Criação de APIs para consumo do frontend em Angular. Projeto governamental que lida com impostos de causa mortis e doações para o estado de Minas Gerais.",
      "p2": "• Acompanhei e fiz parte de todo o desenvolvimento do projeto de ITCD doação, que foi migrado de um monilito para uma arquitetura de microserviços.",
      "p3": "• Implementei a geração e certificação de PDFs atraves do Lacuna Software",
      "p4": "• Integração de autenticação atraves do Keycloak "
    },
    "card3": {
      "p1": "• Criação de um sistema de gestão de aposentadoria para servidores de pequenas cidades.",
      "p2": "• Permitir que administradores analisem e gerencie as solicitações de aposentadoria de seus colaboradores. Permitindo a importações de informações adicionois que são automaticamente consideradas nas projeções.",
      "p3": "• Implementação da um sistema de agendamentos. Adms fornecem os orarios disponíveis e o sistema permite que os usuário agendem conusltas, respeitando os diferentes municípios",
      "p4": "• Geração de PDF com o react-pdf para o sistema de projeções",
      "p5": "• Feito com atenção especial a performace da aplicação, da usuabilidade dos usuários e das melhores práticas de segurança.",
      "p6": "• Deploy da aplicação em uma VPS usando Coolify."
    },
    "technologies": {
      "title": "Tecnologias",
      "subtitle": "Ferramentas e tecnologias que trabalho",
      "advenced": "Avançado",
      "intermediate": "Intermediário",
      "begginer": "Iniciante",
      "other_tools": "Outras ferramentas"
    },  
    "certificates": {
      "title": "Certificates",
      "subtitle": "Recognitions and certifications I’ve earned",
      "cs50x_date": "Emitido em 2023",
      "cs50x_description": "Uma introdução ao desenvolvimento de software. Básico de C, Python e tecnologias web (HTML, CSS e JS)",
      "helsilki_description": "Two separate course, one about typescript, the superset of javascript, and the other about graphql, a alternative way of building the communication between the backend and the frontend"
    },
    "about": {
      "title": "Sobre mim",
      "subtitle": "Conheça-me melhor - minha personalidade, valores e o que me motiva",
      "personal_valies": {
        "title": "Valores Pessoais",
        "t1": "🎯 Solucionador de Problemas",
        "p1": "Sinto uma satisfação estranha ao depurar código. Há algo muito gratificante em caçar a causa raiz de um problema e transformar o caos em clareza. Pra mim, cada bug complicado é uma oportunidade de aprender — e talvez me gabar depois.",
        "t2": "🤝 Jogador de Equipe",
        "p2": "Adoro trabalhar com pessoas que se importam com o que fazem. Seja programando em par, revisando pull requests ou compartilhando momentos de 'aha!', acredito que a colaboração transforma boas ideias em ideias incríveis.",
        "t3": "📚 Aprendiz Contínuo",
        "p3": "A tecnologia evolui rápido — e é exatamente isso que me mantém viciado. Estou sempre testando novos frameworks, experimentando padrões de design ou lendo sobre como outras pessoas resolveram problemas que eu ainda nem encontrei…"
      },
      "working_style": {
        "title": "Estilo de Trabalho",
        "t1": "🔍 Atento aos Detalhes",
        "p1": "Acredito que capricho não é opcional — é parte do ofício. Desde nomear variáveis de forma clara até ajustar o espaçamento da interface, os pequenos detalhes se somam e criam algo que as pessoas realmente gostam de usar.",
        "t2": "⚡ Adaptável e Pragmático",
        "p2": "Gosto de me mover rápido, mas sem imprudência. Itero, testo e ajusto com base em feedback real — porque um bom software não é escrito de uma vez, ele evolui.",
        "t3": "🎨 Focado no Usuário",
        "p3": "Por trás de cada chamada de API e de cada pixel há uma pessoa tentando realizar algo. Eu programo pensando nela — criando experiências que sejam fluidas, intuitivas e que respeitem o tempo do usuário."
      },
      "beyond_title": "Além do código",
      "beyond_subtitle": "O que eu faço quando não estou codando",
      "travel_title": "Viagens",
      "travel_description": "Explorar maravilhas naturais, conhecer novas culturas e pessoas",
      "family_title": "Familia",
      "family_description": "Passar tempo com a familia é minha fonte de prazer, equilibrio e motivação.",
      "chess_title": "Xadrez",
      "chess_description": "Xadrez online é meu passatempo favorito. lulululu1997 no lichess e chess.com",
      "lets_connect": "Entre em contato",
      "connect_subtitle": "Estou sempre aberto para discutir novas oportunidades, projetos interessantes ou simplesmente conversar sobre tecnologia.",
      "emial_me": "Envie-me um email",
      "resume": "Download Curriculo"
    }
  }
}